{
  "profile": {
    "contact": "+91 8692805802",
    "name": "Ashutosh Kolambkar",
    "role": "Front-End Developer",
    "designation": "Front-End Developer",
    "dob": "14th October, 1996",
    "totalexprience": "5 years, 4 months",
    "email": "kolambkarashutosh@gmail.com",
    "location": "Dadar Mumbai, Maharashtra",
    "linkedIn": "https://www.linkedin.com/in/ashutosh-kolambkar/",
    "aboutme": "I am Front-end developer having more than 5 years of experience with technologies ReactJS, AngularJS, HTML5, CSS3, JavaScript, jQuery, PHP, MySQL, python Passionate programmer willing to share knowledge and learn any new technologies to solve problems.",
    "technicalprofiencies": "Frontend Development, Backend Development",
    "workexprience": [
      {
        "company": "Resource One Private Limited",
        "from": "Sept 2023",
        "to": "Oct 2024",
        "designation": "UI Developer",
        "project": "UI Development",
        "roles_responsibilities": [
          { "point": "Engineered UI components in ReactJS and TypeScript, creating dynamic and user-friendly web applications." }, 
          { "point": "Developed responsive and interactive web interfaces utilizing modern JavaScript and React.js to improve user engagement and functionality." }, 
          { "point": "Collaborated with backend developers for seamless frontend-backend integration, providing a consistent and optimized user experience." }, 
          { "point": "Technology Used: React, HTML, Reactstrap, SCSS, Git." }]
      },{
        "company": "Trigent Software Private Limited",
        "from": "Oct 2021",
        "to": "Sept 2023",
        "designation": "Engineer",
        "project": "Engineer",
        "roles_responsibilities": [
          { "point": "Developed and maintained responsive, high-performance web applications using React, Redux Toolkit, Context API, HTML5, CSS3, JavaScript, and Bootstrap, optimizing functionality across devices." }, 
          { "point": "Enhanced web pages for mobile responsiveness and cross-browser compatibility to ensure uniform user experiences." }, 
          { "point": "Collaborated with designers and backend teams to implement modular, scalable code, supporting the application’s performance and future adaptability." }, 
          { "point": "Technology Used: Python, Flask, React, HTML, Reactstrap, SCSS, Git." }]
      },
      {
        "company": "Maharashtra Cyber",
        "from": "Nov 2020",
        "to": "Sept 2021",
        "designation": "Consultant | Internship",
        "project": "Consultant | Internship",
        "roles_responsibilities": [
          { "point": "Collected requirements as per department needs and developed Social Media Monitoring Web Application for collecting complaints regarding offensive posts." },
          { "point": "Included modules to generated automated letters/ reports/notices based on actions taken by the respective authority and dynamically change content as per the sections of India Penal Court criminal procedure code and IT Act." },
          { "point": "Tested government websites for vulnerabilities and reported to the respective authorities with appropriate optimal solution for the same." },
          { "point": "Developed an OSINT Tool called OsintORK for ease in digital investigation for authorities and help fraud online traces of reformation regarding the subject of the case." },
          { "point": "Wrote python scripts for converting manual documents from PDF to CSV." },
          { "point": "Testing reported for efficiency of reading 200 files per minute." },
          { "point": "Technology Used: Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL, Python, Flask." }
        ]
      },
      {
        "company": "Coast to Coast Tourism",
        "from": "Feb 2019",
        "to": "Jan 2020",
        "designation": "Frontend Developer",
        "project": "Frontend Developer",
        "roles_responsibilities": [{ "point": "Built reusable PHP modules in OpenCart framework as per requirement. Collaborated with designers and software engineers to ensure the integrity of the product." }, { "point": "Technology Used: Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL, OpenCart" }, { "point": "Site URL: https://ctctourism.com" }]
      },
      {
        "company": "Vidyalankar School of Information Technology",
        "from": "Sep 2017",
        "to": "Jan 2019",
        "designation": "Frontend Developer",
        "projects": [
          {
            "projectid": 1,
            "projectname": "VSIT Placement",
            "projectdescription": "Built a web application for VSIT Placement cell for uploading latest job opportunities and corelating them with student’s database for eligibility. Maintained a database of students academic and personal details, technical skills and future preferences about their careers.",
            "technologyused": "Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL"
          },
          {
            "projectid": 2,
            "projectname": "VSIT Home Site",
            "projectdescription": "Support given for home site of Vidyalankar School of Information Technology.",
            "technologyused": "Wordpress",
            "siteurl": "http://vsit.edu.in/"
          },
          {
            "projectid": 3,
            "projectname": "Business Integration Tool",
            "projectdescription": "Developed an all-in-one solution for fish products. Inculcated features such as addition, deletion of product, selling price variation, bill generation profit and loss calculation, employee addition and salary generation.",
            "technologyused": "Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL"
          },
          {
            "projectid": 4,
            "projectname": "Network Monitoring Tool",
            "projectdescription": "Developed a web application with functionalities such as adding a new device and category, inventory generation maintenance and monitoring of device, report generation. Monitored the entire network and sent appropriate actions/ notifications if the device fails to work properly.",
            "technologyused": "Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL"
          },
          {
            "projectid": 5,
            "projectname": "V-Commerce Management Technology",
            "projectdescription": "Designed a website for VCMT conference for collecting and approving research papers. Implemented various modules such as admin panel and user login their drafts for approval. Included functionality for admin to approve the submitted drafts and intimate the same.",
            "technologyused": "Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL",
            "siteurl": "http://vcmt.co.in/"
          }
        ],
        "roles_responsibilities": [{ "point": "Built reusable PHP modules in OpenCart framework as per requirement. Collaborated with designers and software engineers to ensure the integrity of the product." }, { "point": "Technology Used: Html5, CSS3, JavaScript, jQuery, PHP, Bootstrap 3, Bootstrap 4, MySQL, OpenCart" }]
      }
    ],
    "education": [
      { "year": "2018-2020", "course": "Master of Sceince - Information Technology", "institution": "Vidyalankar School of Information Technology, Mumbai University" },
      { "year": "2014-2017", "course": "Bachelor of Sceince - Information Technology", "institution": "Vidyalankar School of Information Technology, Mumbai University" },
      { "year": "2012-2014", "course": "Higher Secondary School Certificate", "institution": "Kirti M. Doongurse College Mumbai" },
      { "year": "2002-2012", "course": "Secondary School Certificate", "institution": "Indian Education Society, Modern English School Mumbai" }
    ]
  }
}
